uhnp/src/InformationRegisters/НастройкиЗаполненияОбъектовБД/НастройкиЗаполненияОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗаполненияОбъектовБД</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроводитьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособФормирования</name>
    <type>
      <types>EnumRef.СпособыФормированияДокументовПоПравилам</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравилоЗаполнения</name>
    <type>
      <types>CatalogRef.ПравилаЗаполненияОбъектовБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходныйОбъектБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьГенерации</name>
    <type>
      <types>EnumRef.ОбластиГенерацииОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ОбластиГенерацииОбъектов/ОбластиГенерацииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбластиГенерацииОбъектов</name>
  <enumValues>
    <name>ТекущаяИБ</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяИБ</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыФормированияДокументовПоПравилам/СпособыФормированияДокументовПоПравилам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияДокументовПоПравилам</name>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
  <enumValues>
    <name>РегламентнымЗаданием</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/НастройкиЗаполненияОбъектовБД/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПравилоЗаполненияПриИзменении(Элемент)
	
	ПравилоЗаполненияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПравилоЗаполненияПриИзмененииНаСервере()
	
	ТипБДИсточник=Запись.ПравилоЗаполнения.ТипБД;
	Запись.ИсходныйОбъектБД=Запись.ПравилоЗаполнения.ИсходныйОбъектБД;
	
	ЗаполнитьСписокСпособовФормирования();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектБДПриИзменении(Элемент)
	
	ОбъектБДПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбъектБДПриИзмененииНаСервере()
	
	ТипБДПриемник=Запись.ОбъектБД.Владелец;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
		
		Запись.Период=ТекущаяДата();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи) Тогда
		
		ТипБДИсточник=Запись.ПравилоЗаполнения.ТипБД;
		ТипБДПриемник=Запись.ОбъектБД.Владелец;
		
	Иначе
		
		Запись.ОбластьГенерации=Перечисления.ОбластиГенерацииОбъектов.ТекущаяИБ;
		ТипБДИсточник=Справочники.ТипыБазДанных.ТекущаяИБ;
		ТипБДПриемник=Справочники.ТипыБазДанных.ТекущаяИБ;
		
	КонецЕсли;
	
	ЗаполнитьСписокСпособовФормирования();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемаяИБПриемникПриИзменении(Элемент)
	
	ИспользуемаяИБПриемникПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемаяИБПриемникПриИзмененииНаСервере()
	
	ТипБДПриемник=Запись.ИспользуемаяИБ.ТипБД;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ИспользуемаяИБИсточник.Видимость=(Запись.ОбластьГенерации=Перечисления.ОбластиГенерацииОбъектов.ТекущаяИБ);
	Элементы.ИспользуемаяИБПриемник.Видимость=(Запись.ОбластьГенерации=Перечисления.ОбластиГенерацииОбъектов.ВнешняяИБ);
		
КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура ЗаполнитьСписокСпособовФормирования()
	
	Элементы.СпособФормирования.СписокВыбора.Очистить();
		
	Если ТипБДИсточник=Справочники.ТипыБазДанных.ТекущаяИБ И ЗначениеЗаполнено(Запись.ИсходныйОбъектБД) Тогда
		
		Элементы.СпособФормирования.СписокВыбора.Добавить(Перечисления.СпособыФормированияДокументовПоПравилам.Автоматически);
		
	КонецЕсли;
	
	
	Элементы.СпособФормирования.СписокВыбора.Добавить(Перечисления.СпособыФормированияДокументовПоПравилам.РегламентнымЗаданием);
	Элементы.СпособФормирования.СписокВыбора.Добавить(Перечисления.СпособыФормированияДокументовПоПравилам.Вручную); 
				
КонецПроцедуры // ЗаполнитьСписокСпособовФормирования()

&НаСервере
Процедура ПриИзмененииОбластиГенерации()
	
	Если Запись.ОбластьГенерации=Перечисления.ОбластиГенерацииОбъектов.ВнешняяИБ Тогда
		
		ТипБДИсточник=Справочники.ТипыБазДанных.ТекущаяИБ;
		
	Иначе
		
		ТипБДПриемник=Справочники.ТипыБазДанных.ТекущаяИБ;
		
	КонецЕсли;
	
	УстановитьВидимость();
		
КонецПроцедуры // ПриИзмененииОбластиГенерации() 

&НаКлиенте
Процедура ОбластьГенерацииПриИзменении(Элемент)
	
	ПриИзмененииОбластиГенерации();
	
КонецПроцедуры
